collection/dpi/dpi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-25 周二 11:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1b4c224">1. dpi</a>
<ul>
<li><a href="#orgc2d34c6">1.1. dpi intro</a></li>
<li><a href="#org910365e">1.2. example1： import function</a>
<ul>
<li><a href="#org9703944">1.2.1. sv侧</a></li>
<li><a href="#org52d4bc9">1.2.2. C侧</a></li>
<li><a href="#orgb8d03a7">1.2.3. 可以直接导入C的标准函数</a></li>
</ul>
</li>
<li><a href="#orgbcf28fa">1.3. example: export method.</a>
<ul>
<li><a href="#orga4dd2fb">1.3.1. steps:</a></li>
</ul>
</li>
<li><a href="#orgf744da0">1.4. data type map.</a></li>
<li><a href="#org2d95c22">1.5. argument direstion</a></li>
<li><a href="#org7d596f4">1.6. open array</a></li>
<li><a href="#orgc4e5838">1.7. time consuming task</a>
<ul>
<li><a href="#org2107129">1.7.1. SV layer</a></li>
<li><a href="#org8ea0386">1.7.2. C layer</a></li>
<li><a href="#org237e3b6">1.7.3. SV layer</a></li>
<li><a href="#org1a975d9">1.7.4. ATTENTION</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1b4c224" class="outline-2">
<h2 id="org1b4c224"><span class="section-number-2">1</span> dpi</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgc2d34c6" class="outline-3">
<h3 id="orgc2d34c6"><span class="section-number-3">1.1</span> dpi intro</h3>
<div class="outline-text-3" id="text-1-1">
<p>
sv中的C语言接口。
direct program interface。
svdpi.h。
C语言的编译工具gcc，故C语言应当为标准C，支持标准C++。
</p>
</div>
</div>

<div id="outline-container-org910365e" class="outline-3">
<h3 id="org910365e"><span class="section-number-3">1.2</span> example1： import function</h3>
<div class="outline-text-3" id="text-1-2">
<p>
从C语言导入函数。
</p>
</div>


<div id="outline-container-org9703944" class="outline-4">
<h4 id="org9703944"><span class="section-number-4">1.2.1</span> sv侧</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="orgb836918"></a>声明<br /><div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">
<pre class="src src-verilog">import "DPI-C" function void displaylogicvec(logic [7:0] i);
</pre>
</div>
</div></li>

<li><a id="org60fb40d"></a>调用<br /><div class="outline-text-5" id="text-1-2-1-2">
<div class="org-src-container">
<pre class="src src-verilog">initial displaylogicvec(l);
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-org52d4bc9" class="outline-4">
<h4 id="org52d4bc9"><span class="section-number-4">1.2.2</span> C侧</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#include "svdpi.h"
void displaylogicvec(svLogicVec32 *l) {
  printf("data = %d, control = %d", l-&gt;d, l-&gt;c);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8d03a7" class="outline-4">
<h4 id="orgb8d03a7"><span class="section-number-4">1.2.3</span> 可以直接导入C的标准函数</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-verilog">import "DPI" function chandle malloc(int size);
import "DPI" funciton void free(chandle ptr);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgbcf28fa" class="outline-3">
<h3 id="orgbcf28fa"><span class="section-number-3">1.3</span> example: export method.</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orga4dd2fb" class="outline-4">
<h4 id="orga4dd2fb"><span class="section-number-4">1.3.1</span> steps:</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li><p>
export the sv function in sv-layer
</p>
<div class="org-src-container">
<pre class="src src-verilog">export "DPI" funcion export_fun;
</pre>
</div></li>
<li><p>
define the sv function in sv-layer
</p>
<div class="org-src-container">
<pre class="src src-verilog">function void export_fun(input int foo,string str, logic [7:0] logic_arr, bit [63:0] bit_vec);
int i,j,k;
begin
   $display("%s",str).
   //.....
end
endfunction
</pre>
</div></li>
<li><p>
export the sv function in c-layer
</p>
<div class="org-src-container">
<pre class="src src-c">extern void export_fun(int, char*, svLogicVec32*, svBitVec32*);
</pre>
</div></li>
<li><p>
invoke the sv function in c-layer.
</p>
<div class="org-src-container">
<pre class="src src-c">int add_int()
{
   export_fun(i,str,logic_vec,bit_vec);
}
</pre>
</div></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgf744da0" class="outline-3">
<h3 id="orgf744da0"><span class="section-number-3">1.4</span> data type map.</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>双状态数据类型与四状态数据类型
<dl class="org-dl">
<dt>四状态</dt><dd><p>
reg, logic, interger, time   
</p>
<div class="org-src-container">
<pre class="src src-c">void fib(svLogicVecVal data[20]){
 data0.aval=1;
 data0.bval=0;
}           
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">四状态值</th>
<th scope="col" class="org-right">aval</th>
<th scope="col" class="org-right">bval</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table></dd>
<dt>双状态</dt><dd>bit，int，byte， shortint， longint</dd>
</dl></li>

<li>映射表</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">SV</th>
<th scope="col" class="org-left">CIN</th>
<th scope="col" class="org-left">COUT</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-left">char</td>
<td class="org-left">char*</td>
</tr>

<tr>
<td class="org-left">shortint</td>
<td class="org-left">short int</td>
<td class="org-left">short int*</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">int</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">longint</td>
<td class="org-left">long long int</td>
<td class="org-left">long int*</td>
</tr>

<tr>
<td class="org-left">shortreal</td>
<td class="org-left">float</td>
<td class="org-left">float*</td>
</tr>

<tr>
<td class="org-left">real</td>
<td class="org-left">double</td>
<td class="org-left">double*</td>
</tr>

<tr>
<td class="org-left">string</td>
<td class="org-left">const char*</td>
<td class="org-left">char*</td>
</tr>

<tr>
<td class="org-left">string[N]</td>
<td class="org-left">const char**</td>
<td class="org-left">char**</td>
</tr>

<tr>
<td class="org-left">bit</td>
<td class="org-left">svBit/unsigned char</td>
<td class="org-left">svBit*/unsigned char</td>
</tr>

<tr>
<td class="org-left">log,reg</td>
<td class="org-left">svLogic/unsigned char</td>
<td class="org-left">svLogic* or unsigned char*</td>
</tr>

<tr>
<td class="org-left">bit[N:0]</td>
<td class="org-left">const svBitVecVal*</td>
<td class="org-left">svBitVecVal*</td>
</tr>

<tr>
<td class="org-left">reg[N:0],logic[N:0]</td>
<td class="org-left">const svLogicVecVal*</td>
<td class="org-left">const svLogicVecVal*</td>
</tr>

<tr>
<td class="org-left">open array[]</td>
<td class="org-left">const svOpenArrayHandle</td>
<td class="org-left">svOpenArrayHandle</td>
</tr>

<tr>
<td class="org-left">chandle</td>
<td class="org-left">const void*</td>
<td class="org-left">void*</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2d95c22" class="outline-3">
<h3 id="org2d95c22"><span class="section-number-3">1.5</span> argument direstion</h3>
<div class="outline-text-3" id="text-1-5">
<dl class="org-dl">
<dt>support</dt><dd>input, output &amp; inout.</dd>
<dt>not support</dt><dd>ref.</dd>
<dt>suggession</dt><dd>in C-layer, make the input a const.</dd>
</dl>
</div>
</div>
<div id="outline-container-org7d596f4" class="outline-3">
<h3 id="org7d596f4"><span class="section-number-3">1.6</span> open array</h3>
<div class="outline-text-3" id="text-1-6">
<p>
To transporting arrays.
</p>
<div class="org-src-container">
<pre class="src src-verilog">import "DPI-C" function void mydisplay(inout int h[][]);
program automatic test;
    int  a[6:1][8:3];
    initial begin
       foreach(a[i][j]) a[i][j]=i+j;
       mydisplay(a);
    end
end
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c">void mydisplay(const svOpenArrayHandle h){
    int i,j;
    int lo1=svLow(h,1);
    int hi1=svHigh(h,1);
    int lo2=svLow(h,2);
    int ho2=svHigh(h,2);

    for(i=lo1;i&lt;hi1;i++){
       for (j=lo2;j&lt;hi2;i++){
           int *a = (int *)svGetArrElemPtr2(h,i,j);
           *a = i * j;
       }
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc4e5838" class="outline-3">
<h3 id="orgc4e5838"><span class="section-number-3">1.7</span> time consuming task</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-org2107129" class="outline-4">
<h4 id="org2107129"><span class="section-number-4">1.7.1</span> SV layer</h4>
<div class="outline-text-4" id="text-1-7-1">
<ol class="org-ol">
<li>define time consuming task(tcm_func)
<ul class="org-ul">
<li>wait at time point</li>
<li>invoke a import function(no-time-consumtion) from c-layer</li>
</ul></li>
<li>export time consuming task(tcm_func)</li>
</ol>
</div>
</div>

<div id="outline-container-org8ea0386" class="outline-4">
<h4 id="org8ea0386"><span class="section-number-4">1.7.2</span> C layer</h4>
<div class="outline-text-4" id="text-1-7-2">
<ol class="org-ol">
<li>define time consuming function(extern tcm_func)</li>

<li>invoke imported time consuming function.(run_all_stage)</li>
</ol>
</div>
</div>

<div id="outline-container-org237e3b6" class="outline-4">
<h4 id="org237e3b6"><span class="section-number-4">1.7.3</span> SV layer</h4>
<div class="outline-text-4" id="text-1-7-3">
<ol class="org-ol">
<li>import time consuming function from c layer(run_all_stage)</li>
</ol>
</div>
</div>

<div id="outline-container-org1a975d9" class="outline-4">
<h4 id="org1a975d9"><span class="section-number-4">1.7.4</span> ATTENTION</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
Valuable transported to C-layer is static. Clock would switch between 1 &amp;0.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-07-25 周二 11:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>